docs/acl/acl-bench-results/raw/S04/ping_m0.txt
ERROR: failed to fetch CONFIG from 127.0.0.1:7771
WARN: could not fetch server CONFIG
====== PING_INLINE ======
  20000 requests completed in -0.73 seconds
  50 parallel clients
  64 bytes payload
  keep alive: 1
  multi-thread: no

0.00% <= -2389.6 milliseconds
0.01% <= -2389.5 milliseconds
0.02% <= -2389.4 milliseconds
0.03% <= -2389.3 milliseconds
0.05% <= -2389.2 milliseconds
0.05% <= -2389.1 milliseconds
0.05% <= -2389.0 milliseconds
0.08% <= -2388.9 milliseconds
0.08% <= -2388.8 milliseconds
0.09% <= -2388.6 milliseconds
0.09% <= -2388.5 milliseconds
0.10% <= -2388.4 milliseconds
0.12% <= -2388.3 milliseconds
0.15% <= -2388.2 milliseconds
0.17% <= -2388.1 milliseconds
0.18% <= -2388.0 milliseconds
0.19% <= -2387.9 milliseconds
0.19% <= -2387.8 milliseconds
0.22% <= -2387.7 milliseconds
0.23% <= -2387.5 milliseconds
0.24% <= -2387.4 milliseconds
0.25% <= -2387.3 milliseconds
0.25% <= 0.5 milliseconds
0.26% <= 0.6 milliseconds
0.28% <= 0.7 milliseconds
0.36% <= 0.8 milliseconds
0.62% <= 0.9 milliseconds
1.17% <= 1.0 milliseconds
2.01% <= 1.1 milliseconds
3.31% <= 1.2 milliseconds
5.54% <= 1.3 milliseconds
8.55% <= 1.4 milliseconds
12.39% <= 1.5 milliseconds
16.77% <= 1.6 milliseconds
21.32% <= 1.7 milliseconds
26.17% <= 1.8 milliseconds
31.02% <= 1.9 milliseconds
35.38% <= 2 milliseconds
67.54% <= 3 milliseconds
80.33% <= 4 milliseconds
86.21% <= 5 milliseconds
89.71% <= 6 milliseconds
91.82% <= 7 milliseconds
93.49% <= 8 milliseconds
94.67% <= 9 milliseconds
95.60% <= 10 milliseconds
96.32% <= 11 milliseconds
96.89% <= 12 milliseconds
97.36% <= 13 milliseconds
97.71% <= 14 milliseconds
97.94% <= 15 milliseconds
98.26% <= 16 milliseconds
98.47% <= 17 milliseconds
98.67% <= 18 milliseconds
98.82% <= 19 milliseconds
98.97% <= 20 milliseconds
99.14% <= 21 milliseconds
99.30% <= 22 milliseconds
99.40% <= 23 milliseconds
99.47% <= 24 milliseconds
99.50% <= 25 milliseconds
99.51% <= 26 milliseconds
99.57% <= 27 milliseconds
99.62% <= 28 milliseconds
99.65% <= 29 milliseconds
99.67% <= 30 milliseconds
99.68% <= 31 milliseconds
99.69% <= 32 milliseconds
99.76% <= 33 milliseconds
99.76% <= 34 milliseconds
99.78% <= 35 milliseconds
99.79% <= 36 milliseconds
99.86% <= 37 milliseconds
99.89% <= 57 milliseconds
99.90% <= 58 milliseconds
99.94% <= 59 milliseconds
100.00% <= 59 milliseconds
-27548.21 requests per second

====== PING_BULK ======
  20000 requests completed in 1.35 seconds
  50 parallel clients
  64 bytes payload
  keep alive: 1
  multi-thread: no

1.08% <= 1 milliseconds
35.78% <= 2 milliseconds
71.29% <= 3 milliseconds
87.10% <= 4 milliseconds
94.05% <= 5 milliseconds
96.77% <= 6 milliseconds
98.11% <= 7 milliseconds
98.78% <= 8 milliseconds
99.12% <= 9 milliseconds
99.36% <= 10 milliseconds
99.58% <= 11 milliseconds
99.68% <= 12 milliseconds
99.72% <= 13 milliseconds
99.75% <= 14 milliseconds
99.75% <= 15 milliseconds
99.76% <= 16 milliseconds
99.76% <= 17 milliseconds
99.77% <= 18 milliseconds
99.79% <= 19 milliseconds
99.86% <= 20 milliseconds
99.87% <= 21 milliseconds
99.91% <= 22 milliseconds
99.93% <= 23 milliseconds
99.93% <= 24 milliseconds
99.97% <= 25 milliseconds
100.00% <= 26 milliseconds
100.00% <= 26 milliseconds
14869.89 requests per second