docs/acl/acl-bench-results/raw/S04/ping_m2.txt
ERROR: ERR admin permission required to perform the command
ERROR: failed to fetch CONFIG from 127.0.0.1:7772
WARN: could not fetch server CONFIG
====== PING_INLINE ======
  20000 requests completed in 1.88 seconds
  50 parallel clients
  64 bytes payload
  keep alive: 1
  multi-thread: no

0.00% <= 0.7 milliseconds
0.04% <= 0.8 milliseconds
0.11% <= 0.9 milliseconds
0.37% <= 1.0 milliseconds
0.84% <= 1.1 milliseconds
1.76% <= 1.2 milliseconds
3.11% <= 1.3 milliseconds
4.93% <= 1.4 milliseconds
7.41% <= 1.5 milliseconds
10.12% <= 1.6 milliseconds
13.26% <= 1.7 milliseconds
16.65% <= 1.8 milliseconds
19.75% <= 1.9 milliseconds
22.99% <= 2 milliseconds
52.99% <= 3 milliseconds
69.78% <= 4 milliseconds
79.50% <= 5 milliseconds
85.99% <= 6 milliseconds
89.79% <= 7 milliseconds
92.66% <= 8 milliseconds
94.40% <= 9 milliseconds
95.96% <= 10 milliseconds
96.90% <= 11 milliseconds
97.47% <= 12 milliseconds
97.86% <= 13 milliseconds
98.21% <= 14 milliseconds
98.40% <= 15 milliseconds
98.65% <= 16 milliseconds
98.81% <= 17 milliseconds
98.94% <= 18 milliseconds
99.06% <= 19 milliseconds
99.21% <= 20 milliseconds
99.35% <= 21 milliseconds
99.50% <= 22 milliseconds
99.59% <= 23 milliseconds
99.64% <= 24 milliseconds
99.74% <= 25 milliseconds
99.82% <= 26 milliseconds
99.86% <= 27 milliseconds
99.88% <= 28 milliseconds
99.92% <= 29 milliseconds
99.92% <= 30 milliseconds
99.93% <= 35 milliseconds
99.94% <= 40 milliseconds
99.96% <= 41 milliseconds
99.98% <= 42 milliseconds
99.99% <= 43 milliseconds
100.00% <= 44 milliseconds
100.00% <= 49 milliseconds
10643.96 requests per second

====== PING_BULK ======
  20000 requests completed in 1.87 seconds
  50 parallel clients
  64 bytes payload
  keep alive: 1
  multi-thread: no

0.88% <= 1 milliseconds
31.34% <= 2 milliseconds
60.94% <= 3 milliseconds
73.52% <= 4 milliseconds
80.01% <= 5 milliseconds
84.23% <= 6 milliseconds
87.30% <= 7 milliseconds
89.72% <= 8 milliseconds
92.06% <= 9 milliseconds
93.60% <= 10 milliseconds
94.79% <= 11 milliseconds
95.75% <= 12 milliseconds
96.42% <= 13 milliseconds
97.04% <= 14 milliseconds
97.53% <= 15 milliseconds
97.97% <= 16 milliseconds
98.26% <= 17 milliseconds
98.48% <= 18 milliseconds
98.86% <= 19 milliseconds
99.07% <= 20 milliseconds
99.24% <= 21 milliseconds
99.44% <= 22 milliseconds
99.56% <= 23 milliseconds
99.70% <= 24 milliseconds
99.74% <= 25 milliseconds
99.80% <= 26 milliseconds
99.84% <= 27 milliseconds
99.86% <= 28 milliseconds
99.87% <= 29 milliseconds
99.89% <= 30 milliseconds
99.91% <= 31 milliseconds
99.93% <= 32 milliseconds
99.95% <= 35 milliseconds
99.99% <= 36 milliseconds
99.99% <= 37 milliseconds
100.00% <= 38 milliseconds
100.00% <= 39 milliseconds
10718.11 requests per second